# WoodUsePores Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodUsePores Property
AdvancedWood Class See Also
---
The property labeled "Use pores feature" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodUsePores { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodUsePores As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodUsePores {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace